# Terraform plan for staging completed successfully. \n\n```\n Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: [32m+[0m create[0m Terraform will perform the following actions: [1m # google_compute_instance.sample_vm[0m will be created [0m [32m+[0m[0m resource "google_compute_instance" "sample_vm" { [32m+[0m[0m can_ip_forward = false [32m+[0m[0m cpu_platform = (known after apply) [32m+[0m[0m current_status = (known after apply) [32m+[0m[0m deletion_protection = false [32m+[0m[0m effective_labels = { [32m+[0m[0m "goog-terraform-provisioned" = "true" } [32m+[0m[0m id = (known after apply) [32m+[0m[0m instance_id = (known after apply) [32m+[0m[0m label_fingerprint = (known after apply) [32m+[0m[0m machine_type = "f1-micro" [32m+[0m[0m metadata_fingerprint = (known after apply) [32m+[0m[0m metadata_startup_script = "sudo apt-get update; sudo apt-get install -yq build-essential python3-pip rsync; pip install flask" [32m+[0m[0m min_cpu_platform = (known after apply) [32m+[0m[0m name = "sample-vm" [32m+[0m[0m project = "stg-piny940" [32m+[0m[0m self_link = (known after apply) [32m+[0m[0m tags = [ [32m+[0m[0m "ssh", ] [32m+[0m[0m tags_fingerprint = (known after apply) [32m+[0m[0m terraform_labels = { [32m+[0m[0m "goog-terraform-provisioned" = "true" } [32m+[0m[0m zone = "us-west1-a" [32m+[0m[0m boot_disk { [32m+[0m[0m auto_delete = true [32m+[0m[0m device_name = (known after apply) [32m+[0m[0m disk_encryption_key_sha256 = (known after apply) [32m+[0m[0m kms_key_self_link = (known after apply) [32m+[0m[0m mode = "READ_WRITE" [32m+[0m[0m source = (known after apply) [32m+[0m[0m initialize_params { [32m+[0m[0m image = "debian-cloud/debian-11" [32m+[0m[0m labels = (known after apply) [32m+[0m[0m provisioned_iops = (known after apply) [32m+[0m[0m provisioned_throughput = (known after apply) [32m+[0m[0m size = (known after apply) [32m+[0m[0m type = (known after apply) } } [32m+[0m[0m confidential_instance_config (known after apply) [32m+[0m[0m guest_accelerator (known after apply) [32m+[0m[0m network_interface { [32m+[0m[0m internal_ipv6_prefix_length = (known after apply) [32m+[0m[0m ipv6_access_type = (known after apply) [32m+[0m[0m ipv6_address = (known after apply) [32m+[0m[0m name = (known after apply) [32m+[0m[0m network = (known after apply) [32m+[0m[0m network_ip = (known after apply) [32m+[0m[0m stack_type = (known after apply) [32m+[0m[0m subnetwork = (known after apply) [32m+[0m[0m subnetwork_project = (known after apply) [32m+[0m[0m access_config { [32m+[0m[0m nat_ip = (known after apply) [32m+[0m[0m network_tier = (known after apply) } } [32m+[0m[0m reservation_affinity (known after apply) [32m+[0m[0m scheduling (known after apply) } [1m # google_compute_network.vpc_network[0m will be created [0m [32m+[0m[0m resource "google_compute_network" "vpc_network" { [32m+[0m[0m auto_create_subnetworks = false [32m+[0m[0m delete_default_routes_on_create = false [32m+[0m[0m gateway_ipv4 = (known after apply) [32m+[0m[0m id = (known after apply) [32m+[0m[0m internal_ipv6_range = (known after apply) [32m+[0m[0m mtu = 1460 [32m+[0m[0m name = "my-custom-mode-network" [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL" [32m+[0m[0m numeric_id = (known after apply) [32m+[0m[0m project = "stg-piny940" [32m+[0m[0m routing_mode = (known after apply) [32m+[0m[0m self_link = (known after apply) } [1m # google_compute_subnetwork.default[0m will be created [0m [32m+[0m[0m resource "google_compute_subnetwork" "default" { [32m+[0m[0m creation_timestamp = (known after apply) [32m+[0m[0m external_ipv6_prefix = (known after apply) [32m+[0m[0m fingerprint = (known after apply) [32m+[0m[0m gateway_address = (known after apply) [32m+[0m[0m id = (known after apply) [32m+[0m[0m internal_ipv6_prefix = (known after apply) [32m+[0m[0m ip_cidr_range = "10.0.1.0/24" [32m+[0m[0m ipv6_cidr_range = (known after apply) [32m+[0m[0m name = "my-custom-subnet" [32m+[0m[0m network = (known after apply) [32m+[0m[0m private_ip_google_access = (known after apply) [32m+[0m[0m private_ipv6_google_access = (known after apply) [32m+[0m[0m project = "stg-piny940" [32m+[0m[0m purpose = (known after apply) [32m+[0m[0m region = "us-west1" [32m+[0m[0m self_link = (known after apply) [32m+[0m[0m stack_type = (known after apply) [32m+[0m[0m secondary_ip_range (known after apply) } [1mPlan:[0m 3 to add, 0 to change, 0 to destroy. [0m[90m ─────────────────────────────────────────────────────────────────────────────[0m Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.\n```
